---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointShapeMismatch
source: html/715918ee-7bc6-c67c-abbb-526c4341de29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointShapeMismatch Property

The element has a connector with a fitting joint shape mismatch

## Syntax (C#)
```csharp
public static FailureDefinitionId JointShapeMismatch { get; }
```